snlkuharlocal/src/Documents/ЗаявкаНаДоставку/ЗаявкаНаДоставку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаДоставку</name>
  <basedOn>Document.ЗаявкаНаОтгрузку</basedOn>
  <registerRecords>AccumulationRegister.РаспределениеНакладныхПоЗаявкеНаДоставку</registerRecords>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерХодки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортнаяКомпания</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованнаяСуммаДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяСуммаДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияЗаявокНаДоставку</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Накладные</name>
    <attributes>
      <name>Накладная</name>
      <type>
        <types>DocumentRef.ЗаявкаВТранспортныйОтдел</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоставки</name>
      <type>
        <types>CatalogRef.ПунктыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресПолучателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриемки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяЗагрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПриемки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРазгрузки</name>
      <type>
        <types>CatalogRef.ВремяПриемки</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНакладной</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНакладной</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъёмНакладной</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПаллет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПаллетАвтомобиль</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиПредложения</name>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕмейлПолучателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредложеннаяПолучателемСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредложениеПринято</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КопияПредложения</name>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕмейлПолучателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ЗаявкаНаДоставку/ManagerModule.bsl
//////////////////// НАПЕЧАТАТЬ ДОКУМЕНТ //////////////////////////////////

// ПАРАМЕТРЫ: СохранятьВФайл = Ложь, Заголовок = ""
Функция ПечатьДокумента(ДокументСсылка, ПараметрыПечати = Неопределено) Экспорт
	
	СтруктураВозврата = Новый Структура("Успешно, ИмяФайла", Ложь, "");
	
	СхемаКомпоновкиДанных = ПолучитьМакет("Макет");
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	ЭлементПараметраДанных = Настройки.ПараметрыДанных.Элементы.Найти("Ссылка");
	
	Если ЭлементПараметраДанных = Неопределено Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	ЭлементПараметраДанных.Значение = ДокументСсылка;
	ЭлементПараметраДанных.Использование = Истина;
	
	ЭлементПараметраДанных = Настройки.ПараметрыДанных.Элементы.Найти("НомерДокумента");
	Если ЭлементПараметраДанных <> Неопределено Тогда
		ЭлементПараметраДанных.Значение = ?(ПараметрыПечати = Неопределено, СокрЛП(ДокументСсылка.Номер), ПараметрыПечати.НомерДокумента);
		ЭлементПараметраДанных.Использование = Истина;
	КонецЕсли;
	
	ЭлементПараметраДанных = Настройки.ПараметрыДанных.Элементы.Найти("КодПолучателя");
	Если ЭлементПараметраДанных <> Неопределено Тогда
		ЭлементПараметраДанных.Значение = ?(ПараметрыПечати = Неопределено, "", ПараметрыПечати.КодПолучателя);
		ЭлементПараметраДанных.Использование = Истина;
	КонецЕсли;
	
	ЭлементПараметраДанных = Настройки.ПараметрыДанных.Элементы.Найти("АдресСклада");
	Если ЭлементПараметраДанных <> Неопределено Тогда
		ЭлементПараметраДанных.Значение = ?(ПараметрыПечати = Неопределено,
			СокрЛП(Константы.УзелТранспортногоОтдела.Получить().Подразделение.ОсновнойСклад.Адрес), ПараметрыПечати.АдресСклада);
		ЭлементПараметраДанных.Использование = Истина;
	КонецЕсли;
	
	Счетчик = ?(ПараметрыПечати = Неопределено, 0, ПараметрыПечати.Счетчик);
	
	ЗначениеПараметра = Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Title"));

	Если ПараметрыПечати <> Неопределено И ПараметрыПечати.Свойство("Заголовок") Тогда
		ЗначениеПараметра.Значение = ?(ПараметрыПечати.Заголовок = "", Строка(ДокументСсылка), ПараметрыПечати.Заголовок);
	Иначе
		ЗначениеПараметра.Значение = Строка(ДокументСсылка);
	КонецЕсли;
	ЗначениеПараметра.Использование = Истина;

	КомпоновщикМакета	= Новый КомпоновщикМакетаКомпоновкиДанных;
	ДанныеРасшифровки	= Новый ДанныеРасшифровкиКомпоновкиДанных;	
	МакетКомпоновки		= КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	АдресРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровки, Новый УникальныйИдентификатор);
	
	Если ПараметрыПечати <> Неопределено И ПараметрыПечати.Свойство("СохранятьВФайл") Тогда
		ИмяФайла = КаталогВременныхФайлов() + "ЗаявкаНаДоставку_" + СокрЛП(ДокументСсылка.Номер) + "_" + Строка(Счетчик) + ".xlsx";
		ДокументРезультат.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
		СтруктураВозврата.Вставить("Успешно", Истина);
		СтруктураВозврата.Вставить("ИмяФайла", ИмяФайла);
	Иначе
	    ЗаполнениеДокументов.НапечататьТабличныйДокумент(ДокументРезультат,,,"Накладные", , ,АдресРасшифровки);
		СтруктураВозврата.Вставить("Успешно", Истина);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

//Функция ОтправитьПредложениеВТК(ДокументСсылка) Экспорт
//Тимофеев Ю.А. 10.08.23 ПредпросмотрПисмьма - вывод письма на экран

Функция ОтправитьПредложениеВТК(ДокументСсылка,ПредпросмотрПисмьма=Ложь) Экспорт
	
	ФлагОтправлено = Ложь;   
	
	///Тимофеев Ю.А. начало 03.08.2023
	СписокВКопию = "";    
	
	Если ДокументСсылка.КопияПредложения.Количество()>0 Тогда
		СписокВКопию = Новый СписокЗначений;
		Для Каждого Стр ИЗ ДокументСсылка.КопияПредложения Цикл			 
			Если ЗначениеЗаполнено(Стр.ЕмейлПолучателя) Тогда
				СписокВКопию.Добавить(Стр.ЕмейлПолучателя);
			КонецЕсли; 		 
		КонецЦикла;  	 
	КонецЕсли;
	///Тимофеев Ю.А. конец 03.08.2023
	
	
	
	Если ДокументСсылка.ПолучателиПредложения.Количество() Тогда
		
		ПараметрыПечати = Новый Структура("Заголовок, НомерДокумента, КодПолучателя, СохранятьВФайл", "", "", "", Истина);
		
		ТекстПисьма = "Прошу рассмотреть заявку во вложении, заполнить поле Сумма и выслать вложение обратной почтой";
		ТемаПисьма = "Прошу рассмотреть заявку " + СокрЛП(ДокументСсылка.Номер);
		Вложение = Неопределено;
		
		Счетчик = 0;
		
		УчПочтаОтправителя=Справочники.УчетныеЗаписиЭлектроннойПочты.УчетнаяЗаписьОбменаСТК;

		
		Для Каждого Стр ИЗ ДокументСсылка.ПолучателиПредложения Цикл
			
			Если ЗначениеЗаполнено(Стр.ЕмейлПолучателя) Тогда
				
				Заголовок = "Заявка на доставку " + СокрЛП(ДокументСсылка.Номер) + " для контрагента " + СокрЛП(Стр.Получатель);
				
				ПараметрыПечати.Вставить("Заголовок", Заголовок);
				ПараметрыПечати.Вставить("НомерДокумента", СокрЛП(ДокументСсылка.Номер));
				ПараметрыПечати.Вставить("КодПолучателя", ?(Стр.Получатель.Пустая(), "", СокрЛП(Стр.Получатель.Код)));
				ПараметрыПечати.Вставить("Счетчик", Счетчик);
				ПараметрыПечати.Вставить("АдресСклада", СокрЛП(Константы.УзелТранспортногоОтдела.Получить().Подразделение.ОсновнойСклад.Адрес));
				
				СтруктураВозврата = Документы.ЗаявкаНаДоставку.ПечатьДокумента(ДокументСсылка, ПараметрыПечати);
				Если СтруктураВозврата.ИмяФайла <> "" Тогда
					
					
					//Тимофеев Ю.А. 10.08.2023 Начало
					Если ПредпросмотрПисмьма Тогда 
						//выведим форму только на просмотр
						ТП=Новый ТабличныйДокумент;
						ТП.Прочитать(СтруктураВозврата.ИмяФайла);
						ТП.ОтображатьСетку=Ложь;
						ТП.ОтображатьЗаголовки=Ложь;
						ТП.Защита =Истина;
						ВысотаТаб=ТП.ВысотаТаблицы+2;
						ТП.Область(ВысотаТаб,2).Текст="ТОЛЬКО ПРОСМОТР. ЕСЛИ НУЖНО ВНЕСТИ ИЗМЕНЕНИЯ. ЗАКРЫВАЕМ ПЕЧАТНУЮ ФОРМУ и ПРАВИМ ДОКУМЕНТ!";
						ТП.Область(ВысотаТаб,2).ЦветТекста = Новый Цвет(255,0,0);
						ТП.Показать("Проверка письма перед отправкой.Правки вносим строго в документе !");						
						Возврат Ложь;
					КонецЕсли;  					
					//Тимофеев Ю.А. 10.08.2023 Конец 					
					
					
					///Тимофеев Ю.А. начало 03.08.2023
					//добавим еще один параметр
					//СформироватьВнутреннееУведомление(СокрЛП(Стр.ЕмейлПолучателя), ТекстПисьма, ТемаПисьма, ДокументСсылка,
					//	, СтруктураВозврата.ИмяФайла, Справочники.УчетныеЗаписиЭлектроннойПочты.УчетнаяЗаписьОбменаСТК); 
										
					СформироватьВнутреннееУведомление(СокрЛП(Стр.ЕмейлПолучателя), ТекстПисьма, ТемаПисьма, ДокументСсылка,
					, СтруктураВозврата.ИмяФайла, УчПочтаОтправителя,СписокВКопию,Счетчик); 
					
					///Тимофеев Ю.А. конец 17.08.2023  добавим счетчик для записи регистра
					
					///Тимофеев Ю.А. конец 03.08.2023
						
					ФлагОтправлено = Истина;
					Счетчик = Счетчик + 1;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Кухарь А.Ю.  05.06.2023 начало
	//
	Параметры=новый ТаблицаЗначений;
	Параметры.Колонки.Добавить("Имя");
	Параметры.Колонки.Добавить("Значение");
	СтрТЗ=Параметры.Добавить();
	СтрТЗ.Имя="Обработка";
	СтрТЗ.Значение="ОбработатьПисьмаНаОтправку";
	
	СтрТЗ=Параметры.Добавить();
	СтрТЗ.Имя="ОтборПоДокументу";
	СтрТЗ.Значение=ДокументСсылка;

	МассивПараметров=новый Массив;
	МассивПараметров.Добавить(Параметры);
	ФоновыеЗадания.Выполнить("Регламент.ВнешнееЗадание",МассивПараметров,новый УникальныйИдентификатор,"Отправка писем по  "+ДокументСсылка);
	// Кухарь А.Ю.  05.06.2023 конец
	
	
	Возврат ФлагОтправлено;
	
	
КонецФункции


///Тимофеев Ю.А. конец 09.08.2023
//При отработки документа - отправка результата тендера
//ФлагОтправки - булево - Истина - всем, Ложь - только Победителю

Процедура ОтправитьРезультатТендера(ДокументСсылка,ФлагОтправки) Экспорт
		
	СписокВКопию = "";    
	
	Если ДокументСсылка.КопияПредложения.Количество()>0 Тогда
		СписокВКопию = Новый СписокЗначений;
		Для Каждого Стр ИЗ ДокументСсылка.КопияПредложения Цикл			 
			Если ЗначениеЗаполнено(Стр.ЕмейлПолучателя) Тогда
				СписокВКопию.Добавить(Стр.ЕмейлПолучателя);
			КонецЕсли; 		 
		КонецЦикла;  	 
	КонецЕсли;
	
	Если ДокументСсылка.ПолучателиПредложения.Количество() Тогда
		
		//победитель тендера		
		ТекстПисьмаП = "Вы назначены перевозчиком по - Заявка на доставку " + СокрЛП(ДокументСсылка.Номер);
		ТемаПисьмаП  = "Тендер завершен. Вы назначены перевозчиком !";
		//участник  тендера
		ТекстПисьма = "Спасибо за участие в тендере "+ СокрЛП(ДокументСсылка.Номер);
		ТемаПисьма  = "Тендер завершен. Заявку выполняет другой перевозчик";

		УчПочтаОтправителя=Справочники.УчетныеЗаписиЭлектроннойПочты.УчетнаяЗаписьОбменаСТК;
		
		Счетчик=0;
		
		Для Каждого Стр ИЗ ДокументСсылка.ПолучателиПредложения Цикл
			
			Если ЗначениеЗаполнено(Стр.ЕмейлПолучателя) Тогда 			
				
				Если Стр.ПредложениеПринято Тогда //победитель тендера		
					
					СформироватьВнутреннееУведомление(СокрЛП(Стр.ЕмейлПолучателя), ТекстПисьмаП, ТемаПисьмаП, ДокументСсылка,
					, Неопределено,УчПочтаОтправителя,СписокВКопию,Счетчик); 
					
				Иначе
					
					Если ФлагОтправки Тогда   //участник  тендера
						
						СформироватьВнутреннееУведомление(СокрЛП(Стр.ЕмейлПолучателя), ТекстПисьма, ТемаПисьма, ДокументСсылка,
						,Неопределено, УчПочтаОтправителя,СписокВКопию,Счетчик);
						
					КонецЕсли;
					
				КонецЕсли;    				
				
			КонецЕсли;
			Счетчик=Счетчик+1;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Кухарь А.Ю.  05.06.2023 начало
	//
	Параметры=новый ТаблицаЗначений;
	Параметры.Колонки.Добавить("Имя");
	Параметры.Колонки.Добавить("Значение");
	СтрТЗ=Параметры.Добавить();
	СтрТЗ.Имя="Обработка";
	СтрТЗ.Значение="ОбработатьПисьмаНаОтправку";
	
	СтрТЗ=Параметры.Добавить();
	СтрТЗ.Имя="ОтборПоДокументу";
	СтрТЗ.Значение=ДокументСсылка;

	МассивПараметров=новый Массив;
	МассивПараметров.Добавить(Параметры);
		
	ФоновыеЗадания.Выполнить("Регламент.ВнешнееЗадание",МассивПараметров,новый УникальныйИдентификатор,"Отправка писем по  "+ДокументСсылка); //ТЮА
		
	// Кухарь А.Ю.  05.06.2023 конец
	          	
КонецПроцедуры

///Тимофеев Ю.А. конец 09.08.2023




Функция ПолучитьПочтовыйОтвет(ПочтовыйЯщик) Экспорт
	
	/// ПочтовыйЯщик - справочник УчетныеЗаписиЭлектроннойПочты
	///	Договорились забирать почту с отдельного ящика
	
	ФлагУспешно = Ложь;
	
	СтруктураВозврата = Новый Структура("КоличествоВложений, ФлагУспешно", 0, ФлагУспешно);
	
	Профиль = Справочники.УчетныеЗаписиЭлектроннойПочты.ПолучитьИнтернетПочтовыйПрофиль(ПочтовыйЯщик);
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивСообщений = Новый Массив;
	
	Попытка
		
		Почта = Новый ИнтернетПочта;
		Почта.Подключиться(Профиль, ПротоколИнтернетПочты.IMAP);
		
		// Получаем все сообщения из почтового ящика
		МассивСообщений = Почта.Выбрать(Истина,,Истина);
		
	Исключение
		
		// Ошибка при подключении к серверу или при приеме сообщения
		#Если Клиент Тогда
			Сообщить("Ошибка при подключении или приеме" + ОписаниеОшибки());
		#КонецЕсли
		ЗаписатьВЛог("Подключение к эл.почте","Ошибка при подключении или приеме" + ОписаниеОшибки(),"Ошибка");
		УстановитьПривилегированныйРежим(Ложь);
		Возврат СтруктураВозврата;
		
	КонецПопытки;
	
	Если МассивСообщений.Количество() = 0 Тогда
		// Сообщений в почтовом ящике нет
		Почта.Отключиться();
		УстановитьПривилегированныйРежим(Ложь);
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Если МассивСообщений.Количество() > 0 Тогда 
		
		//Тимофеев Ю.А. 15.08.2023 Начало
		//если сообщения найдены - отправим их копии ОВЛ
		//Создадим профиль для отправки копии сообщения
		
		ПочтовыйПрофиль = Новый ИнтернетПочтовыйПрофиль;
		ПараметрыПочты  = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
		ЗаполнитьЗначенияСвойств(ПочтовыйПрофиль,ПараметрыПочты);
		ПочтаОтправка   = Новый ИнтернетПочта();
		
		//Тимофеев Ю.А. 15.08.2023 Конец

		
		
		Индекс = 0;
		Для Каждого Сообщение ИЗ МассивСообщений Цикл
			// Перебираем вложения письма
			Для Каждого Вложение Из Сообщение.Вложения Цикл
				Попытка
					Вложение.Данные.Записать(КаталогВременныхФайлов() + "ЗаявкаНаДоставку_" + Строка(Индекс) + ".xlsx");
					Индекс = Индекс + 1;
					ФлагУспешно = Истина;
				Исключение
					СообщитьИзМодуля(ОписаниеОшибки());
					ФлагУспешно = Ложь;
				КонецПопытки;
			КонецЦикла;
			
			
			//Тимофеев Ю.А. 15.08.2023 Начало  
			//переименуем тему соообщения добавим приставку - [АВТОБОТ-ПЕРЕСЫЛКА] 
			//заменим получателей на - ПочтовыйЯщик.АдресЭлектроннойПочты - /Учетная запись обмена с ТК  ovlexchangetk@collant.ru
			
			//Если Найти(Сообщение.Тема,"[ПЕРЕСЫЛКА-АВТОБОТ]") =0 Тогда   //Тимофеев Ю.А. 13.02.2024 /чтобы не циклились сообщения
			//	
			//	ПочтаОтправка.Подключиться(ПочтовыйПрофиль);
			//	Сообщение.Тема       ="[ПЕРЕСЫЛКА-АВТОБОТ] "+Сообщение.Тема; 
			//	
			//	Сообщение.Получатели.Очистить();
			//	//Сообщение.Получатели.Добавить(ПочтовыйЯщик.АдресЭлектроннойПочты);  //Учетная запись обмена с ТК  ovlexchangetk@collant.ru     
			//	Сообщение.Получатели.Добавить("ovlto@collant.ru");     //Тимофеев Ю.А. 13.02.2024
			//	 
			//	Попытка 
			//		ПочтаОтправка.Послать(Сообщение);			
			//	Исключение 
			//		Сообщить(ОписаниеОшибки()); 				 
			//	КонецПопытки; 	
			//	
			//КонецЕсли;
			
		КонецЦикла;
	

		
		//Тимофеев Ю.А. 15.08.2023 Конец

		
		
		
		Если ФлагУспешно Тогда
			Почта.УдалитьСообщения(МассивСообщений);
		КонецЕсли;
		
		Почта.Отключиться(); 
		
		//Тимофеев Ю.А. 15.08.2023 Начало
		ПочтаОтправка.Отключиться();
		//Тимофеев Ю.А. 15.08.2023 Начало

		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	СтруктураВозврата.Вставить("КоличествоВложений", Индекс);
	СтруктураВозврата.Вставить("ФлагУспешно", ФлагУспешно);
	
	Возврат СтруктураВозврата;

	
КонецФункции

Функция ОбработатьПочтовыйОтвет() Экспорт
	
	МассивФайловВложений = НайтиФайлы(КаталогВременныхФайлов(), "ЗаявкаНаДоставку_*.xlsx");
	МассивКУдалению = Новый Массив;
	
	Если МассивФайловВложений.Количество() > 0 Тогда
		
		Для Каждого Файл ИЗ МассивФайловВложений Цикл
			
			///////// ПРОЧИТАЕМ ФАЙЛЫ ЭКСЕЛЬ ////////////////////////////////////////////
			
			ТабДок = Новый ТабличныйДокумент;
			Попытка
				ТабДок.Прочитать(Файл.ПолноеИмя);
			Исключение
				СообщитьИзМодуля(ОписаниеОшибки());
				Продолжить;
			КонецПопытки;
	
			ОбластиТаб = ТабДок.Область(4, 1, 5, 7);
	
			Построитель = Новый ПостроительЗапроса;
			Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластиТаб);  
			Построитель.Выполнить();
	
			ТабДанные = Построитель.Результат.Выгрузить();			
			
			/////////////////////////////////////////////////////////////////////////////
			
			Если ТабДанные.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НомерДокумента = СокрЛП(ТабДанные[0].НомерДокумента);
			КодПолучателя = СокрЛП(ТабДанные[0].КодПолучателя);
			
			СуммаИзЭксельСтрокой = СокрЛП(ТабДанные[0].Сумма);
			Попытка
				СуммаИзЭксель = Число(СуммаИзЭксельСтрокой);
			Исключение
				СуммаИзЭксель = 0;
			КонецПопытки;
			
			Если СокрЛП(НомерДокумента) = "" Тогда
				Продолжить;
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("НомерДокумента", НомерДокумента);
			Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЗаявкаНаДоставку.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ЗаявкаНаДоставку КАК ЗаявкаНаДоставку
			|ГДЕ
			|	ЗаявкаНаДоставку.Номер = &НомерДокумента
			|	И НЕ ЗаявкаНаДоставку.ПометкаУдаления
			|
			|УПОРЯДОЧИТЬ ПО
			|	ЗаявкаНаДоставку.Дата УБЫВ";
			
			УстановитьПривилегированныйРежим(Истина);
			Выборка = Запрос.Выполнить().Выбрать();
			УстановитьПривилегированныйРежим(Ложь);
			
			Если Выборка.Следующий() Тогда
				
				ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
				Если ДокОбъект <> Неопределено И КодПолучателя <> "" И СуммаИзЭксель <> 0 Тогда
					
					ФлагСохранять = Ложь;
					
					Запрос.УстановитьПараметр("КодПолучателя", КодПолучателя);
					Запрос.Текст =
					"ВЫБРАТЬ ПЕРВЫЕ 1
					|	ЕСТЬNULL(Контрагенты.Ссылка, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Получатель
					|ИЗ
					|	Справочник.Контрагенты КАК Контрагенты
					|ГДЕ
					|	Контрагенты.Код = &КодПолучателя
					|	И НЕ Контрагенты.ПометкаУдаления
					|	И НЕ Контрагенты.ЭтоГруппа";
					
					УстановитьПривилегированныйРежим(Истина);
					ВыборкаКонтрагент = Запрос.Выполнить().Выбрать();
					УстановитьПривилегированныйРежим(Ложь);
					
					Получатель = Справочники.Контрагенты.ПустаяСсылка();
					Если ВыборкаКонтрагент.Следующий() Тогда
						Получатель = ВыборкаКонтрагент.Получатель;
					КонецЕсли;
					
					НайденныеСтроки = ДокОбъект.ПолучателиПредложения.НайтиСтроки(Новый Структура("Получатель", Получатель));
					
					Если НайденныеСтроки.Количество() > 0 Тогда 
						Для Каждого НайденнаяСтрока ИЗ НайденныеСтроки Цикл
							НайденнаяСтрока.ПредложеннаяПолучателемСумма = СуммаИзЭксель;
							ФлагСохранять = Истина;
						КонецЦикла;
					Иначе
						НоваяСтрока = ДокОбъект.ПолучателиПредложения.Добавить();
						НоваяСтрока.Получатель = Получатель;
						НоваяСтрока.ПредложеннаяПолучателемСумма = СуммаИзЭксель;
						ФлагСохранять = Истина;
					КонецЕсли;
					
					Если ФлагСохранять Тогда
						Попытка
							ДокОбъект.Записать();
							МассивКУдалению.Добавить(Файл.Имя);
							СообщитьИзМодуля("Изменен документ " + Строка(ДокОбъект.Ссылка));
						Исключение
							СообщитьИзМодуля(ОписаниеОшибки());
						КонецПопытки;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат МассивКУдалению;
	
КонецФункции

Функция УдалитьОбработанныеФайлы(МассивКУдалению) Экспорт
	
	//////// УДАЛИМ УСПЕШНО ОБРАБОТАННЫЕ /////////////////////////////////////
	
	Удалено = Ложь;
	Если МассивКУдалению.Количество() > 0 Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		Для Каждого ИмяФайла ИЗ МассивКУдалению Цикл
			Попытка
				УдалитьФайлы(КаталогВременныхФайлов(), ИмяФайла);
				Удалено = Истина;
			Исключение
				СообщитьИзМодуля("Не могу удалить " + ИмяФайла);
				Удалено = Ложь;
			КонецПопытки;
		КонецЦикла;
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
	Возврат Удалено;
	
КонецФункции
